# CurrentTheme Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
UIThemeManager..::..CurrentTheme Property
UIThemeManager Class See Also
---
The current theme.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2014
# Syntax
C#
---
```text
public static UITheme CurrentTheme { get; set; }
```

Visual Basic
---
```text
Public Shared Property CurrentTheme As UITheme
	Get
	Set
```

Visual C++
---
```text
public:
static property UITheme CurrentTheme {
	UITheme get ();
	void set (UITheme value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
UIThemeManager Class
Autodesk.Revit.UI Namespace